import type { AdmissionDataType } from "@/types/admission";

export const AdmissionData: AdmissionDataType = {
    stats: {
        undergraduate: '2k',
        international: "135",
        Postgraduate: "200"
    },
    undergraduateFeatures:
    {
        title: 'الدعم المالي لطلبة المرحلة الجامعية الأولى',
        description: 'تلبي كلية البريمي الجامعية كافة احتياجات الطلاب المقبولين المؤهلين للحصول على مساعدات مالية. وقد يكون الطلاب الجامعيون مؤهلين للحصول على رسوم دراسية أقل بناءً على فئة الخصم الخاصة بهم.',

    }
    ,
    postgraduatePrograms:
    {
        title: 'الرسوم الدراسية والمساعدات المالية للدراسات العليا',
        description: 'تختلف الرسوم الدراسية للدراسات العليا في كلية البريمي الجامعية حسب الدرجة والبرنامج وحالة التسجيل، كما تختلف خيارات المساعدة المالية. يحظى حوالي 85% من طلاب الدراسات العليا في كلية البريمي الجامعية بالدعم المالي.',

    }
    ,
    discounts: [
        {
            percentage: '30%',
            title: 'خصم 30% على الرسوم الدراسية',
            categories: 'ذوي الاحتياجات الخاصة وأبنائهم، وموظفي المجلس الأعلى للقضاء – درجة البكالوريوس، وموظفي كلية البريمي الجامعية "أبنائهم وزوجاتهم".',
            color: 'from-[#254151] to-[#6096b4]'
        },
        {
            percentage: '25%',
            title: 'خصم 25% على الرسوم الدراسية',
            categories: 'شرطة عمان السلطانية وذويهم – لدرجة البكالوريوس.',
            color: 'from-[#6096b4] to-[#254151]'
        },
        {
            percentage: '20%',
            title: 'خصم 20% على الرسوم الدراسية',
            categories: 'الطلبة الدوليين، أبناء محافظة مسندم، المحامون المسجلون – الماجستير بوزارة الأوقاف والشؤون الدينية وأسرهم، حاملي بطاقة السعادة وبطاقة فزعة.',
            color: 'from-[#c2a772] to-[#254151]'
        },
        {
            percentage: '15%',
            title: 'خصم 15% على الرسوم الدراسية',
            categories: 'أبناء موظفي القطاع الخاص والمتقاعدين منهم وأقاربهم من الدرجة الأولى.',
            color: 'from-[#254151] to-[#c2a772]'
        }
    ],
}
